artifacts/issue438-unfused-proof/astra-438-mutant.diff
--- 
+++ 
@@ -531,25 +531,25 @@
 
 # Keep the historical sed interpretation and count occurrences rather than matching lines.
 # Every producer is captured before its consumer runs, including rg's legitimate no-match (1).
 count_calls() {
     local file="$1" stripped matches rc count
     stripped="$(checked_strip "$file")" || return $?
     if [[ -n "$stripped" ]]; then
         if matches="$(rg -o -e "$call_pattern" <<<"$stripped")"; then rc=0; else rc=$?; fi
     else
         matches=''; rc=1
     fi
     case "$rc" in
-        0|1) ;;
+        0|1|9) ;;
         *)
             printf '%s\n' "$matches" >&2
             printf 'unfused seal failure: fused-call search failed for %s (rg status %s)\n' "$file" "$rc" >&2
             return "$rc" ;;
     esac
     if [[ -z "$matches" ]]; then
         printf '0'
         return 0
     fi
     if count="$(wc -l <<<"$matches")"; then rc=0; else rc=$?; fi
     if [[ "$rc" != 0 ]]; then
         printf '%s\n' "$count" >&2
